In [77]:
import pandas as pd 
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /Users/Stefania/opt/anaconda3/envs/data_env/lib/python3.7/site-packages (1.3.10)

In [78]:
import pymysql
from sqlalchemy import create_engine

In [79]:
final_df = pd.read_csv('forbes.csv')

In [80]:
final_df.head()

,ID,First Name,Last Name,Position,Worth,Source,Age,Unnamed: 0,Gender,Country,Image
0,5227,Jeff,Bezos,1.0,112.0 BUSD,Technology ==> Amazon,54 years old,52,None,United States,https://specials-images.forbesimg.com/imageser...
1,2642,Bill,Gates,2.0,90.0 BUSD,Technology ==> Microsoft,62 years old,53,M,None,https://specials-images.forbesimg.com/imageser...
2,5422,Warren,Buffett,3.0,84.0 BUSD,Finance and Investments ==> Berkshire Hathaway,87 years old,54,M,None,https://specials-images.forbesimg.com/imageser...
3,8183,Bernard,Arnault,4.0,72.0 BUSD,Fashion & Retail ==> LVMH,69 years old,55,M,France,https://specials-images.forbesimg.com/imageser...
4,5642,Mark,Zuckerberg,5.0,71.0 BUSD,Technology ==> Facebook,1985,56,M,USA,https://specials-images.forbesimg.com/imageser...

In [81]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2208 entries, 0 to 2207
Data columns (total 11 columns):
ID            2208 non-null int64
First Name    2208 non-null object
Last Name     2208 non-null object
Position      2208 non-null float64
Worth         2208 non-null object
Source        2208 non-null object
Age           2143 non-null object
Unnamed: 0    2208 non-null int64
Gender        2195 non-null object
Country       2208 non-null object
Image         2208 non-null object
dtypes: float64(1), int64(2), object(8)
memory usage: 189.9+ KB

In [82]:
final_df.drop('Unnamed: 0', axis=1, inplace=True)

In [83]:
final_df.Gender.unique()

array(['None', 'M', 'Male', 'F', nan, 'Female'], dtype=object)

# GENDER NULES

In [84]:
null_cols = final_df.isnull().sum()
null_cols
null_cols[null_cols > 0]

Age       65
Gender    13
dtype: int64

In [85]:
null_displ = final_df[(final_df['Gender'].isnull()==True)]

In [86]:
null_displ = null_displ[['ID', 'First Name', 'Last Name', 'Position', 'Worth', 'Source', 'Age', 'Gender', 'Country', 'Image']]
null_displ

,ID,First Name,Last Name,Position,Worth,Source,Age,Gender,Country,Image
26,1202,Beate,Albrecht jr.,27.0,29.8 BUSD,Fashion & Retail ==> supermarkets,66 years old,NaN,Germany,https://specials-images.forbesimg.com/imageser...
163,7836,Gianluigi,Aponte,164.0,9.3 BUSD,Logistics ==> Shipping,77 years old,NaN,None,https://specials-images.forbesimg.com/imageser...
224,1197,Willi,Liebherr,225.0,7.1 BUSD,Construction & Engineering ==> Construction,NaN,NaN,None,https://specials-images.forbesimg.com/imageser...
309,5024,Tom,Love,310.0,5.8 BUSD,Fashion & Retail ==> retail & gas stations,81 years old,NaN,USA,https://specials-images.forbesimg.com/imageser...
426,3416,Philip,Green,427.0,4.8 BUSD,Fashion & Retail ==> fashion retail,66 years old,NaN,None,https://specials-images.forbesimg.com/imageser...
529,3488,Jack,Dangermond,530.0,4.1 BUSD,Technology ==> mapping software,72 years old,NaN,None,https://specials-images.forbesimg.com/imageser...
581,9068,Stewart,Resnick,582.0,3.9 BUSD,"Food and Beverage ==> agriculture, water",NaN,NaN,None,https://specials-images.forbesimg.com/imageser...
596,7398,Dominika,Kulczyk,597.0,3.8 BUSD,Finance and Investments ==> diversified,NaN,NaN,None,https://specials-images.forbesimg.com/imageser...
731,6616,Andrew,Cherng,732.0,3.2 BUSD,Food and Beverage ==> restaurants,NaN,NaN,None,https://specials-images.forbesimg.com/imageser...
766,8071,Do,Chang,767.0,3.1 BUSD,Fashion & Retail ==> fashion retail,62 years old,NaN,None,https://specials-images.forbesimg.com/imageser...
1197,7859,Ong,Ong beng seng,1198.0,2.1 BUSD,Diversified ==> diversified,73 years old,NaN,None,https://specials-images.forbesimg.com/imageser...
1260,9780,Chuchat,Petaumpai,1261.0,2.0 BUSD,Finance and Investments ==> motorcycle loans,65 years old,NaN,None,https://specials-images.forbesimg.com/imageser...
1290,4362,Jean-paul,Clozel,1291.0,1.9 BUSD,Healthcare ==> pharmaceuticals,NaN,NaN,Switzerland,https://specials-images.forbesimg.com/imageser...

In [87]:
final_df.Gender.unique()

array(['None', 'M', 'Male', 'F', nan, 'Female'], dtype=object)

In [88]:
#13 gender Nulls (NaN) index 26 and 596 are female

In [89]:
(final_df.loc[26, 'Gender'])

nan

In [90]:
final_df.loc[26, 'Gender']

nan

In [91]:
final_df.loc[26, 'Gender']='Female'
display(final_df.loc[26, 'Gender'])

'Female'

In [92]:
final_df.loc[596, 'Gender']

nan

In [93]:
final_df.loc[596, 'Gender']='Female'
display(final_df.loc[596, 'Gender'])

'Female'

In [94]:
final_df.Gender.unique()

array(['None', 'M', 'Male', 'F', 'Female', nan], dtype=object)

In [95]:
final_df.isnull().sum(axis = 0)

ID             0
First Name     0
Last Name      0
Position       0
Worth          0
Source         0
Age           65
Gender        11
Country        0
Image          0
dtype: int64

In [96]:
#11 Gender NaN are Male

In [97]:
final_df["Gender"].fillna("Male", inplace = True)

In [98]:
final_df.isnull().sum(axis = 0)

ID             0
First Name     0
Last Name      0
Position       0
Worth          0
Source         0
Age           65
Gender         0
Country        0
Image          0
dtype: int64

In [99]:
final_df.Gender.dtype

dtype('O')

In [100]:
final_df.astype({'Gender': str}).dtypes

ID              int64
First Name     object
Last Name      object
Position      float64
Worth          object
Source         object
Age            object
Gender         object
Country        object
Image          object
dtype: object

In [101]:
null_cols = final_df.isnull().sum()
null_cols[null_cols > 0]

Age    65
dtype: int64

In [102]:
final_df.Gender.unique()

array(['None', 'M', 'Male', 'F', 'Female'], dtype=object)

In [103]:
final_df.loc[final_df['Gender'].str.startswith('M'), 'Gender_cat'] = 'Male'

In [104]:
final_df.loc[final_df['Gender'].str.startswith('F'), 'Gender_cat'] = 'Female'

In [105]:
final_df.head()

,ID,First Name,Last Name,Position,Worth,Source,Age,Gender,Country,Image,Gender_cat
0,5227,Jeff,Bezos,1.0,112.0 BUSD,Technology ==> Amazon,54 years old,None,United States,https://specials-images.forbesimg.com/imageser...,NaN
1,2642,Bill,Gates,2.0,90.0 BUSD,Technology ==> Microsoft,62 years old,M,None,https://specials-images.forbesimg.com/imageser...,Male
2,5422,Warren,Buffett,3.0,84.0 BUSD,Finance and Investments ==> Berkshire Hathaway,87 years old,M,None,https://specials-images.forbesimg.com/imageser...,Male
3,8183,Bernard,Arnault,4.0,72.0 BUSD,Fashion & Retail ==> LVMH,69 years old,M,France,https://specials-images.forbesimg.com/imageser...,Male
4,5642,Mark,Zuckerberg,5.0,71.0 BUSD,Technology ==> Facebook,1985,M,USA,https://specials-images.forbesimg.com/imageser...,Male

In [106]:
#How Many 'Gender_cat"=NaN'?

In [107]:
final_df.Gender_cat.unique()

array([nan, 'Male', 'Female'], dtype=object)

In [108]:
null_displ = final_df[(final_df['Gender_cat'].isnull()==True)]

In [109]:
final_df[['Gender_cat']] = final_df[['Gender_cat']].fillna('Not Available')

In [110]:
final_df.Gender_cat.unique()

array(['Not Available', 'Male', 'Female'], dtype=object)

In [111]:
null_cols = final_df.isnull().sum()
null_cols[null_cols > 0]

Age    65
dtype: int64

In [112]:
final_df.Gender_cat.unique()

array(['Not Available', 'Male', 'Female'], dtype=object)

# AGE NULES

In [113]:
null_displ = final_df[(final_df['Age'].isnull()==True)]

In [114]:
null_displ = null_displ[['ID', 'First Name', 'Last Name', 'Position', 'Worth', 'Source', 'Age', 'Gender', 'Country', 'Image','Gender_cat']]
null_displ

,ID,First Name,Last Name,Position,Worth,Source,Age,Gender,Country,Image,Gender_cat
54,3450,Hinduja,Hinduja,55.0,19.5 BUSD,Diversified ==> diversified,NaN,M,None,https://specials-images.forbesimg.com/imageser...,Male
76,3303,Thomas,Kwok,77.0,16.5 BUSD,Real Estate ==> real estate,NaN,M,Hong Kong,https://specials-images.forbesimg.com/imageser...,Male
89,4298,David,Reuben,90.0,15.5 BUSD,"Real Estate ==> investments, real estate",NaN,None,None,https://specials-images.forbesimg.com/imageser...,Not Available
129,4712,Udo,Tschira,130.0,11.7 BUSD,Technology ==> software,NaN,None,Germany,https://specials-images.forbesimg.com/imageser...,Not Available
141,5750,Robert,Ng,142.0,10.8 BUSD,Real Estate ==> real estate,NaN,M,None,https://specials-images.forbesimg.com/imageser...,Male
...,...,...,...,...,...,...,...,...,...,...,...
2020,8561,Yupa,Chiaravanond,2021.0,1.1 BUSD,Diversified ==> diversified,NaN,None,None,https://specials-images.forbesimg.com/imageser...,Not Available
2021,9744,Prathip,Chiravanond,2022.0,1.1 BUSD,Diversified ==> diversified,NaN,Male,Thailand,https://specials-images.forbesimg.com/imageser...,Male
2028,8909,Wolfgang,Egger,2029.0,1.1 BUSD,Real Estate ==> real estate,NaN,M,Germany,https://specials-images.forbesimg.com/imageser...,Male
2044,6937,Madhu,Kapur,2045.0,1.1 BUSD,Finance and Investments ==> banking,NaN,F,None,https://specials-images.forbesimg.com/imageser...,Female
2117,7889,Swift,Xie,2118.0,1.1 BUSD,Technology ==> drones,NaN,None,None,https://specials-images.forbesimg.com/imageser...,Not Available

In [115]:
final_df.Age.unique()

array(['54 years old', '62 years old', '87 years old', '69 years old',
       '1985', '82 years old', '78 years old', '73 years old',
       '76 years old', '45 years old', '44 years old', '70 years old',
       '68 years old', '46 years old', '64 years old', '61 years old',
       '53 years old', '84 years old', '90 years old', '59 years old',
       '63 years old', '66 years old', '80 years old', '81 years old',
       '56 years old', '79 years old', '74 years old', '60 years old',
       '93 years old', '52 years old', '1983', '65 years old',
       '83 years old', '67 years old', '75 years old', '89 years old',
       nan, '72 years old', '48 years old', '77 years old',
       '86 years old', '57 years old', '1988', '55 years old',
       '94 years old', '47 years old', '71 years old', '92 years old',
       '88 years old', '85 years old', '49 years old', '51 years old',
       '50 years old', '43 years old', '42 years old', '91 years old',
       '58 years old', '1984', '38 years old', '1982', '95 years old',
       '39 years old', '41 years old', '40 years old', '1990', '1991',
       '97 years old', '1986', '99 years old', '1994', '1998', '1996',
       '96 years old', '1987', '1989', '1992'], dtype=object)

In [116]:
final_df[['Age']] = final_df[['Age']].fillna(0)

In [117]:
final_df.isnull().sum(axis = 0)

ID            0
First Name    0
Last Name     0
Position      0
Worth         0
Source        0
Age           0
Gender        0
Country       0
Image         0
Gender_cat    0
dtype: int64

In [118]:
final_df.Age.unique()

array(['54 years old', '62 years old', '87 years old', '69 years old',
       '1985', '82 years old', '78 years old', '73 years old',
       '76 years old', '45 years old', '44 years old', '70 years old',
       '68 years old', '46 years old', '64 years old', '61 years old',
       '53 years old', '84 years old', '90 years old', '59 years old',
       '63 years old', '66 years old', '80 years old', '81 years old',
       '56 years old', '79 years old', '74 years old', '60 years old',
       '93 years old', '52 years old', '1983', '65 years old',
       '83 years old', '67 years old', '75 years old', '89 years old', 0,
       '72 years old', '48 years old', '77 years old', '86 years old',
       '57 years old', '1988', '55 years old', '94 years old',
       '47 years old', '71 years old', '92 years old', '88 years old',
       '85 years old', '49 years old', '51 years old', '50 years old',
       '43 years old', '42 years old', '91 years old', '58 years old',
       '1984', '38 years old', '1982', '95 years old', '39 years old',
       '41 years old', '40 years old', '1990', '1991', '97 years old',
       '1986', '99 years old', '1994', '1998', '1996', '96 years old',
       '1987', '1989', '1992'], dtype=object)

In [119]:
print(set(final_df['Age']))

{0, '51 years old', '66 years old', '87 years old', '84 years old', '68 years old', '53 years old', '43 years old', '80 years old', '1984', '54 years old', '56 years old', '86 years old', '1986', '44 years old', '62 years old', '48 years old', '49 years old', '82 years old', '91 years old', '74 years old', '71 years old', '76 years old', '52 years old', '41 years old', '60 years old', '78 years old', '83 years old', '69 years old', '94 years old', '88 years old', '61 years old', '79 years old', '1991', '1996', '47 years old', '55 years old', '50 years old', '1994', '95 years old', '58 years old', '93 years old', '72 years old', '85 years old', '39 years old', '1990', '45 years old', '63 years old', '75 years old', '67 years old', '73 years old', '1983', '81 years old', '77 years old', '65 years old', '59 years old', '57 years old', '42 years old', '1982', '1987', '1992', '99 years old', '1988', '90 years old', '70 years old', '1989', '46 years old', '92 years old', '89 years old', '1985', '97 years old', '38 years old', '1998', '96 years old', '64 years old', '40 years old'}

In [120]:
final_df['Age'] = final_df['Age'].str.replace('years old', '')
print(set(final_df['Age']))

{nan, '95 ', '39 ', '70 ', '75 ', '59 ', '66 ', '52 ', '65 ', '53 ', '86 ', '1984', '63 ', '77 ', '40 ', '84 ', '72 ', '1986', '48 ', '60 ', '96 ', '46 ', '94 ', '54 ', '97 ', '87 ', '71 ', '42 ', '76 ', '50 ', '81 ', '38 ', '78 ', '88 ', '67 ', '47 ', '64 ', '58 ', '51 ', '1991', '45 ', '1996', '61 ', '1994', '41 ', '56 ', '57 ', '85 ', '90 ', '1990', '91 ', '44 ', '99 ', '93 ', '92 ', '62 ', '68 ', '1983', '89 ', '1987', '80 ', '55 ', '1982', '1992', '82 ', '49 ', '1988', '73 ', '43 ', '1989', '1998', '1985', '83 ', '74 ', '79 ', '69 '}

In [121]:
final_df.isnull().sum(axis = 0)

ID             0
First Name     0
Last Name      0
Position       0
Worth          0
Source         0
Age           65
Gender         0
Country        0
Image          0
Gender_cat     0
dtype: int64

In [122]:
final_df[['Age']] = final_df[['Age']].fillna(0)

In [123]:
final_df.isnull().sum(axis = 0)

ID            0
First Name    0
Last Name     0
Position      0
Worth         0
Source        0
Age           0
Gender        0
Country       0
Image         0
Gender_cat    0
dtype: int64

In [124]:
print(set(final_df['Age']))

{0, '95 ', '39 ', '70 ', '75 ', '59 ', '66 ', '52 ', '65 ', '53 ', '86 ', '1984', '63 ', '77 ', '40 ', '84 ', '72 ', '1986', '48 ', '60 ', '96 ', '46 ', '94 ', '54 ', '97 ', '87 ', '71 ', '42 ', '76 ', '50 ', '81 ', '38 ', '78 ', '88 ', '67 ', '47 ', '64 ', '58 ', '51 ', '1991', '45 ', '1996', '61 ', '1994', '41 ', '56 ', '57 ', '85 ', '90 ', '1990', '91 ', '44 ', '99 ', '93 ', '92 ', '62 ', '68 ', '1983', '89 ', '1987', '80 ', '55 ', '1982', '1992', '82 ', '49 ', '1988', '73 ', '43 ', '1989', '1998', '1985', '83 ', '74 ', '79 ', '69 '}

In [125]:
#Because value='0' cant be replaced, it becomes nan again.
final_df['Age'] = final_df['Age'].str.replace('1982', '36')
print(set(final_df['Age']))

{nan, '95 ', '39 ', '70 ', '75 ', '59 ', '36', '66 ', '52 ', '65 ', '53 ', '86 ', '1984', '63 ', '77 ', '40 ', '84 ', '72 ', '1986', '48 ', '60 ', '96 ', '46 ', '94 ', '54 ', '97 ', '87 ', '71 ', '42 ', '76 ', '50 ', '81 ', '38 ', '78 ', '88 ', '67 ', '47 ', '64 ', '58 ', '51 ', '1991', '45 ', '1996', '61 ', '1994', '41 ', '56 ', '57 ', '85 ', '90 ', '1990', '91 ', '44 ', '99 ', '93 ', '92 ', '62 ', '68 ', '1983', '89 ', '1987', '80 ', '55 ', '1992', '82 ', '49 ', '1988', '73 ', '43 ', '1989', '1998', '1985', '83 ', '74 ', '79 ', '69 '}

In [126]:
final_df['Age'] = final_df['Age'].str.replace('1984', '34')
print(set(final_df['Age']))

{nan, '95 ', '39 ', '70 ', '75 ', '59 ', '36', '66 ', '52 ', '65 ', '53 ', '86 ', '40 ', '63 ', '77 ', '84 ', '72 ', '1986', '48 ', '60 ', '96 ', '46 ', '94 ', '54 ', '97 ', '87 ', '71 ', '42 ', '76 ', '50 ', '81 ', '38 ', '78 ', '88 ', '67 ', '47 ', '64 ', '58 ', '51 ', '1991', '45 ', '1996', '61 ', '1994', '41 ', '56 ', '57 ', '85 ', '90 ', '1990', '91 ', '44 ', '99 ', '93 ', '92 ', '62 ', '68 ', '1983', '89 ', '1987', '80 ', '55 ', '1992', '34', '82 ', '49 ', '1988', '73 ', '43 ', '1989', '1998', '1985', '83 ', '74 ', '79 ', '69 '}

In [127]:
final_df['Age'] = final_df['Age'].str.replace('1989', '29')
print(set(final_df['Age']))

{nan, '95 ', '39 ', '70 ', '75 ', '59 ', '36', '66 ', '52 ', '65 ', '53 ', '86 ', '40 ', '63 ', '77 ', '84 ', '72 ', '1986', '48 ', '60 ', '96 ', '46 ', '94 ', '54 ', '97 ', '29', '87 ', '71 ', '42 ', '76 ', '50 ', '81 ', '38 ', '78 ', '88 ', '67 ', '47 ', '64 ', '58 ', '51 ', '1991', '45 ', '1996', '61 ', '1994', '41 ', '56 ', '57 ', '85 ', '90 ', '1990', '91 ', '44 ', '99 ', '93 ', '92 ', '62 ', '68 ', '1983', '89 ', '1987', '80 ', '55 ', '1992', '34', '82 ', '49 ', '1988', '73 ', '43 ', '1998', '1985', '83 ', '74 ', '79 ', '69 '}

In [128]:
final_df['Age'] = final_df['Age'].str.replace('1983', '35')
print(set(final_df['Age']))

{nan, '95 ', '39 ', '70 ', '75 ', '59 ', '36', '66 ', '52 ', '65 ', '53 ', '86 ', '40 ', '63 ', '77 ', '84 ', '35', '72 ', '1986', '48 ', '60 ', '96 ', '46 ', '94 ', '54 ', '97 ', '29', '87 ', '71 ', '42 ', '76 ', '50 ', '81 ', '38 ', '78 ', '88 ', '67 ', '47 ', '64 ', '58 ', '51 ', '1991', '45 ', '1996', '61 ', '1994', '41 ', '56 ', '57 ', '85 ', '90 ', '1990', '91 ', '44 ', '99 ', '93 ', '92 ', '62 ', '68 ', '89 ', '1987', '80 ', '55 ', '1992', '34', '82 ', '49 ', '1988', '73 ', '43 ', '1998', '1985', '83 ', '74 ', '79 ', '69 '}

In [129]:
final_df['Age'] = final_df['Age'].str.replace('1986', '32')
print(set(final_df['Age']))

{nan, '95 ', '39 ', '70 ', '75 ', '59 ', '36', '66 ', '52 ', '65 ', '53 ', '86 ', '40 ', '63 ', '77 ', '84 ', '35', '72 ', '48 ', '60 ', '96 ', '46 ', '94 ', '54 ', '97 ', '29', '87 ', '71 ', '42 ', '32', '76 ', '50 ', '81 ', '38 ', '78 ', '88 ', '67 ', '47 ', '64 ', '58 ', '51 ', '1991', '45 ', '1996', '61 ', '1994', '41 ', '56 ', '57 ', '85 ', '90 ', '1990', '91 ', '44 ', '99 ', '93 ', '92 ', '62 ', '68 ', '89 ', '1987', '80 ', '55 ', '1992', '34', '82 ', '49 ', '1988', '73 ', '43 ', '1998', '1985', '83 ', '74 ', '79 ', '69 '}

In [130]:
final_df['Age'] = final_df['Age'].str.replace('1985', '33')
print(set(final_df['Age']))

{nan, '95 ', '39 ', '70 ', '75 ', '59 ', '36', '66 ', '52 ', '65 ', '53 ', '86 ', '40 ', '63 ', '77 ', '84 ', '35', '72 ', '48 ', '60 ', '96 ', '46 ', '94 ', '54 ', '97 ', '29', '87 ', '71 ', '42 ', '32', '33', '76 ', '50 ', '81 ', '38 ', '78 ', '88 ', '67 ', '47 ', '64 ', '58 ', '51 ', '1991', '45 ', '1996', '61 ', '1994', '41 ', '56 ', '57 ', '85 ', '90 ', '1990', '91 ', '44 ', '99 ', '93 ', '92 ', '62 ', '68 ', '89 ', '1987', '80 ', '55 ', '1992', '34', '82 ', '49 ', '1988', '73 ', '43 ', '1998', '83 ', '74 ', '79 ', '69 '}

In [131]:
final_df['Age'] = final_df['Age'].str.replace('1988', '30')
print(set(final_df['Age']))

{nan, '95 ', '39 ', '70 ', '75 ', '59 ', '36', '66 ', '52 ', '65 ', '53 ', '86 ', '40 ', '63 ', '77 ', '84 ', '35', '72 ', '48 ', '60 ', '96 ', '46 ', '94 ', '54 ', '97 ', '29', '87 ', '71 ', '42 ', '32', '33', '76 ', '50 ', '81 ', '38 ', '78 ', '88 ', '67 ', '47 ', '64 ', '58 ', '51 ', '1991', '45 ', '1996', '61 ', '1994', '41 ', '56 ', '57 ', '85 ', '90 ', '1990', '91 ', '44 ', '99 ', '93 ', '92 ', '62 ', '68 ', '89 ', '1987', '80 ', '30', '55 ', '1992', '34', '82 ', '49 ', '43 ', '73 ', '1998', '83 ', '74 ', '79 ', '69 '}

In [132]:
final_df['Age'] = final_df['Age'].str.replace('1990', '28')
print(set(final_df['Age']))

{nan, '95 ', '39 ', '70 ', '75 ', '59 ', '36', '66 ', '52 ', '65 ', '28', '53 ', '86 ', '40 ', '63 ', '77 ', '84 ', '35', '72 ', '48 ', '60 ', '96 ', '46 ', '94 ', '54 ', '97 ', '29', '87 ', '71 ', '42 ', '32', '33', '76 ', '50 ', '81 ', '38 ', '78 ', '88 ', '67 ', '47 ', '64 ', '58 ', '51 ', '1991', '45 ', '1996', '61 ', '1994', '41 ', '56 ', '57 ', '85 ', '90 ', '91 ', '44 ', '99 ', '93 ', '92 ', '62 ', '68 ', '89 ', '1987', '80 ', '30', '55 ', '1992', '34', '82 ', '49 ', '43 ', '73 ', '1998', '83 ', '74 ', '79 ', '69 '}

In [133]:
final_df['Age'] = final_df['Age'].str.replace('1991', '27')
print(set(final_df['Age']))

{nan, '95 ', '39 ', '70 ', '75 ', '59 ', '36', '66 ', '52 ', '65 ', '28', '53 ', '86 ', '40 ', '63 ', '77 ', '84 ', '35', '72 ', '48 ', '60 ', '96 ', '46 ', '94 ', '54 ', '97 ', '29', '87 ', '71 ', '42 ', '32', '33', '76 ', '50 ', '81 ', '38 ', '78 ', '88 ', '67 ', '47 ', '64 ', '58 ', '51 ', '27', '45 ', '1996', '61 ', '1994', '41 ', '56 ', '57 ', '85 ', '90 ', '91 ', '44 ', '99 ', '93 ', '92 ', '62 ', '68 ', '89 ', '1987', '80 ', '30', '55 ', '1992', '34', '82 ', '49 ', '43 ', '73 ', '1998', '83 ', '74 ', '79 ', '69 '}

In [134]:
final_df['Age'] = final_df['Age'].str.replace('1996', '22')
print(set(final_df['Age']))

{nan, '95 ', '39 ', '70 ', '75 ', '59 ', '36', '66 ', '52 ', '65 ', '28', '53 ', '86 ', '40 ', '63 ', '77 ', '84 ', '35', '72 ', '48 ', '60 ', '96 ', '46 ', '94 ', '54 ', '97 ', '29', '87 ', '71 ', '42 ', '32', '33', '76 ', '50 ', '81 ', '38 ', '78 ', '88 ', '67 ', '47 ', '64 ', '58 ', '51 ', '27', '45 ', '61 ', '1994', '41 ', '56 ', '57 ', '85 ', '90 ', '91 ', '44 ', '99 ', '93 ', '92 ', '62 ', '68 ', '89 ', '1987', '80 ', '30', '55 ', '1992', '34', '82 ', '49 ', '43 ', '73 ', '22', '1998', '83 ', '74 ', '79 ', '69 '}

In [135]:
final_df['Age'] = final_df['Age'].str.replace('1998', '20')
print(set(final_df['Age']))

{nan, '95 ', '39 ', '70 ', '75 ', '59 ', '36', '66 ', '52 ', '65 ', '28', '53 ', '86 ', '40 ', '63 ', '77 ', '84 ', '35', '72 ', '48 ', '60 ', '96 ', '46 ', '94 ', '54 ', '97 ', '29', '87 ', '71 ', '42 ', '32', '33', '76 ', '50 ', '81 ', '38 ', '20', '78 ', '88 ', '67 ', '47 ', '64 ', '58 ', '51 ', '27', '45 ', '61 ', '1994', '41 ', '56 ', '57 ', '85 ', '90 ', '91 ', '44 ', '99 ', '93 ', '92 ', '62 ', '68 ', '89 ', '1987', '80 ', '30', '55 ', '1992', '34', '82 ', '49 ', '43 ', '73 ', '22', '83 ', '74 ', '79 ', '69 '}

In [136]:
final_df['Age'] = final_df['Age'].str.replace('1992', '26')
print(set(final_df['Age']))

{nan, '95 ', '39 ', '70 ', '75 ', '59 ', '36', '66 ', '52 ', '65 ', '28', '53 ', '86 ', '40 ', '63 ', '77 ', '26', '84 ', '35', '72 ', '48 ', '60 ', '96 ', '46 ', '94 ', '54 ', '97 ', '29', '87 ', '71 ', '42 ', '32', '33', '76 ', '50 ', '81 ', '38 ', '20', '78 ', '88 ', '67 ', '47 ', '64 ', '58 ', '51 ', '27', '45 ', '61 ', '1994', '41 ', '56 ', '57 ', '85 ', '90 ', '91 ', '44 ', '99 ', '93 ', '92 ', '62 ', '68 ', '89 ', '1987', '80 ', '30', '55 ', '34', '82 ', '49 ', '43 ', '73 ', '22', '83 ', '74 ', '79 ', '69 '}

In [137]:
final_df['Age'] = final_df['Age'].str.replace('1994', '24')
print(set(final_df['Age']))

{nan, '95 ', '39 ', '70 ', '75 ', '59 ', '36', '66 ', '52 ', '65 ', '28', '53 ', '86 ', '40 ', '63 ', '77 ', '26', '84 ', '35', '72 ', '24', '48 ', '60 ', '96 ', '46 ', '94 ', '54 ', '97 ', '29', '87 ', '71 ', '42 ', '32', '33', '76 ', '50 ', '81 ', '38 ', '20', '78 ', '88 ', '67 ', '47 ', '64 ', '58 ', '51 ', '27', '45 ', '61 ', '41 ', '56 ', '57 ', '85 ', '90 ', '91 ', '44 ', '99 ', '93 ', '92 ', '62 ', '68 ', '89 ', '1987', '80 ', '30', '55 ', '34', '82 ', '49 ', '43 ', '73 ', '22', '83 ', '74 ', '79 ', '69 '}

In [138]:
final_df['Age'] = final_df['Age'].str.replace('1987', '31')
print(set(final_df['Age']))

{nan, '95 ', '39 ', '70 ', '75 ', '59 ', '36', '66 ', '52 ', '65 ', '28', '53 ', '86 ', '40 ', '63 ', '77 ', '26', '84 ', '35', '72 ', '24', '48 ', '60 ', '96 ', '46 ', '94 ', '54 ', '97 ', '29', '87 ', '71 ', '42 ', '32', '33', '76 ', '50 ', '81 ', '38 ', '20', '78 ', '88 ', '67 ', '47 ', '64 ', '58 ', '51 ', '27', '45 ', '61 ', '41 ', '56 ', '57 ', '85 ', '90 ', '91 ', '44 ', '99 ', '93 ', '92 ', '62 ', '68 ', '89 ', '80 ', '30', '55 ', '34', '82 ', '49 ', '31', '43 ', '73 ', '22', '83 ', '74 ', '79 ', '69 '}

In [139]:
final_df.isnull().sum(axis = 0)

ID             0
First Name     0
Last Name      0
Position       0
Worth          0
Source         0
Age           65
Gender         0
Country        0
Image          0
Gender_cat     0
dtype: int64

In [140]:
final_df[['Age']] = final_df[['Age']].fillna(0)

In [141]:
final_df.isnull().sum(axis = 0)

ID            0
First Name    0
Last Name     0
Position      0
Worth         0
Source        0
Age           0
Gender        0
Country       0
Image         0
Gender_cat    0
dtype: int64

In [142]:
final_df.Age.unique()

array(['54 ', '62 ', '87 ', '69 ', '33', '82 ', '78 ', '73 ', '76 ',
       '45 ', '44 ', '70 ', '68 ', '46 ', '64 ', '61 ', '53 ', '84 ',
       '90 ', '59 ', '63 ', '66 ', '80 ', '81 ', '56 ', '79 ', '74 ',
       '60 ', '93 ', '52 ', '35', '65 ', '83 ', '67 ', '75 ', '89 ', 0,
       '72 ', '48 ', '77 ', '86 ', '57 ', '30', '55 ', '94 ', '47 ',
       '71 ', '92 ', '88 ', '85 ', '49 ', '51 ', '50 ', '43 ', '42 ',
       '91 ', '58 ', '34', '38 ', '36', '95 ', '39 ', '41 ', '40 ', '28',
       '27', '97 ', '32', '99 ', '24', '20', '22', '96 ', '31', '29',
       '26'], dtype=object)

In [143]:
final_df['Age'] = final_df['Age'].str.replace(' ', '')
print(set(final_df['Age']))

{nan, '36', '61', '75', '28', '53', '82', '50', '76', '44', '97', '86', '26', '35', '92', '39', '40', '24', '55', '45', '59', '78', '80', '60', '91', '29', '99', '74', '52', '33', '56', '48', '85', '41', '65', '32', '20', '27', '88', '72', '54', '66', '73', '70', '83', '64', '84', '38', '42', '89', '93', '94', '47', '63', '77', '71', '57', '79', '62', '87', '67', '51', '81', '96', '30', '58', '34', '43', '95', '31', '22', '69', '68', '90', '46', '49'}

In [144]:
final_df[['Age']] = final_df[['Age']].fillna(0)

In [145]:
final_df.astype({'Age': int}).dtypes

ID              int64
First Name     object
Last Name      object
Position      float64
Worth          object
Source         object
Age             int64
Gender         object
Country        object
Image          object
Gender_cat     object
dtype: object

In [146]:
final_df.Age = final_df.Age.astype(int)

In [147]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2208 entries, 0 to 2207
Data columns (total 11 columns):
ID            2208 non-null int64
First Name    2208 non-null object
Last Name     2208 non-null object
Position      2208 non-null float64
Worth         2208 non-null object
Source        2208 non-null object
Age           2208 non-null int64
Gender        2208 non-null object
Country       2208 non-null object
Image         2208 non-null object
Gender_cat    2208 non-null object
dtypes: float64(1), int64(2), object(8)
memory usage: 189.9+ KB

In [148]:
final_df['Age'].mean()

61.91440217391305

In [149]:
final_df.replace({'Age': {0: 62}})

,ID,First Name,Last Name,Position,Worth,Source,Age,Gender,Country,Image,Gender_cat
0,5227,Jeff,Bezos,1.0,112.0 BUSD,Technology ==> Amazon,54,None,United States,https://specials-images.forbesimg.com/imageser...,Not Available
1,2642,Bill,Gates,2.0,90.0 BUSD,Technology ==> Microsoft,62,M,None,https://specials-images.forbesimg.com/imageser...,Male
2,5422,Warren,Buffett,3.0,84.0 BUSD,Finance and Investments ==> Berkshire Hathaway,87,M,None,https://specials-images.forbesimg.com/imageser...,Male
3,8183,Bernard,Arnault,4.0,72.0 BUSD,Fashion & Retail ==> LVMH,69,M,France,https://specials-images.forbesimg.com/imageser...,Male
4,5642,Mark,Zuckerberg,5.0,71.0 BUSD,Technology ==> Facebook,33,M,USA,https://specials-images.forbesimg.com/imageser...,Male
...,...,...,...,...,...,...,...,...,...,...,...
2203,7670,Zhao,Zhao,2204.0,1.0 BUSD,"Fashion & Retail ==> fashion, entertainment",51,None,China,https://specials-images.forbesimg.com/imageser...,Not Available
2204,1310,Zhou,Zhou,2205.0,1.0 BUSD,Manufacturing ==> electrical equipment,55,M,China,https://specials-images.forbesimg.com/imageser...,Male
2205,4488,Zhu,Zhu,2206.0,1.0 BUSD,Manufacturing ==> electrical equipment,51,M,None,https://specials-images.forbesimg.com/imageser...,Male
2206,7152,Zhuo,Zhuo,2207.0,1.0 BUSD,Manufacturing ==> printed circuit boards,52,Female,Hong Kong,https://specials-images.forbesimg.com/imageser...,Female
2207,7214,Olgun,Zorlu,2208.0,1.0 BUSD,Diversified ==> diversified,54,None,Turkey,https://specials-images.forbesimg.com/imageser...,Not Available

In [150]:
#Age column: non-null objects but we have 65 records with a value of "0". Have to fill it in with the column's mean.

In [151]:
final_df.Age.unique()

array([54, 62, 87, 69, 33, 82, 78, 73, 76, 45, 44, 70, 68, 46, 64, 61, 53,
       84, 90, 59, 63, 66, 80, 81, 56, 79, 74, 60, 93, 52, 35, 65, 83, 67,
       75, 89,  0, 72, 48, 77, 86, 57, 30, 55, 94, 47, 71, 92, 88, 85, 49,
       51, 50, 43, 42, 91, 58, 34, 38, 36, 95, 39, 41, 40, 28, 27, 97, 32,
       99, 24, 20, 22, 96, 31, 29, 26])

In [152]:
final_df.head()

,ID,First Name,Last Name,Position,Worth,Source,Age,Gender,Country,Image,Gender_cat
0,5227,Jeff,Bezos,1.0,112.0 BUSD,Technology ==> Amazon,54,None,United States,https://specials-images.forbesimg.com/imageser...,Not Available
1,2642,Bill,Gates,2.0,90.0 BUSD,Technology ==> Microsoft,62,M,None,https://specials-images.forbesimg.com/imageser...,Male
2,5422,Warren,Buffett,3.0,84.0 BUSD,Finance and Investments ==> Berkshire Hathaway,87,M,None,https://specials-images.forbesimg.com/imageser...,Male
3,8183,Bernard,Arnault,4.0,72.0 BUSD,Fashion & Retail ==> LVMH,69,M,France,https://specials-images.forbesimg.com/imageser...,Male
4,5642,Mark,Zuckerberg,5.0,71.0 BUSD,Technology ==> Facebook,33,M,USA,https://specials-images.forbesimg.com/imageser...,Male

# POSITION to INT

In [153]:
final_df.Position = final_df.Position.astype(int)

In [154]:
final_df.Position.unique()

array([   1,    2,    3, ..., 2206, 2207, 2208])

In [155]:
final_df.Worth.unique()

array(['112.0 BUSD', '90.0 BUSD', '84.0 BUSD', '72.0 BUSD', '71.0 BUSD',
       '70.0 BUSD', '67.1 BUSD', '60.0 BUSD', '58.5 BUSD', '50.0 BUSD',
       '48.8 BUSD', '47.5 BUSD', '46.4 BUSD', '46.2 BUSD', '46.0 BUSD',
       '45.3 BUSD', '42.2 BUSD', '40.1 BUSD', '39.0 BUSD', '38.5 BUSD',
       '38.4 BUSD', '34.9 BUSD', '30.3 BUSD', '30.0 BUSD', '29.8 BUSD',
       '29.6 BUSD', '27.4 BUSD', '27.0 BUSD', '25.3 BUSD', '25.0 BUSD',
       '23.6 BUSD', '23.5 BUSD', '23.0 BUSD', '22.7 BUSD', '22.6 BUSD',
       '22.0 BUSD', '21.9 BUSD', '21.7 BUSD', '21.2 BUSD', '20.9 BUSD',
       '20.3 BUSD', '20.2 BUSD', '20.1 BUSD', '20.0 BUSD', '19.9 BUSD',
       '19.5 BUSD', '19.1 BUSD', '18.8 BUSD', '18.7 BUSD', '18.6 BUSD',
       '18.5 BUSD', '18.2 BUSD', '18.0 BUSD', '17.9 BUSD', '17.8 BUSD',
       '17.7 BUSD', '17.5 BUSD', '17.4 BUSD', '17.3 BUSD', '16.8 BUSD',
       '16.7 BUSD', '16.5 BUSD', '16.4 BUSD', '16.3 BUSD', '16.0 BUSD',
       '15.9 BUSD', '15.8 BUSD', '15.6 BUSD', '15.5 BUSD', '15.3 BUSD',
       '15.1 BUSD', '15.0 BUSD', '14.9 BUSD', '14.8 BUSD', '14.7 BUSD',
       '14.6 BUSD', '14.4 BUSD', '14.1 BUSD', '14.0 BUSD', '13.6 BUSD',
       '13.4 BUSD', '13.0 BUSD', '12.9 BUSD', '12.8 BUSD', '12.7 BUSD',
       '12.6 BUSD', '12.5 BUSD', '12.3 BUSD', '12.2 BUSD', '12.1 BUSD',
       '12.0 BUSD', '11.9 BUSD', '11.8 BUSD', '11.7 BUSD', '11.6 BUSD',
       '11.5 BUSD', '11.3 BUSD', '11.2 BUSD', '11.0 BUSD', '10.8 BUSD',
       '10.7 BUSD', '10.5 BUSD', '10.3 BUSD', '10.2 BUSD', '10.1 BUSD',
       '10.0 BUSD', '9.8 BUSD', '9.7 BUSD', '9.6 BUSD', '9.5 BUSD',
       '9.4 BUSD', '9.3 BUSD', '9.2 BUSD', '9.1 BUSD', '9.0 BUSD',
       '8.9 BUSD', '8.8 BUSD', '8.7 BUSD', '8.5 BUSD', '8.3 BUSD',
       '8.2 BUSD', '8.1 BUSD', '8.0 BUSD', '7.9 BUSD', '7.8 BUSD',
       '7.7 BUSD', '7.6 BUSD', '7.4 BUSD', '7.3 BUSD', '7.2 BUSD',
       '7.1 BUSD', '7.0 BUSD', '6.9 BUSD', '6.8 BUSD', '6.7 BUSD',
       '6.6 BUSD', '6.5 BUSD', '6.4 BUSD', '6.3 BUSD', '6.2 BUSD',
       '6.1 BUSD', '6.0 BUSD', '5.9 BUSD', '5.8 BUSD', '5.7 BUSD',
       '5.6 BUSD', '5.5 BUSD', '5.4 BUSD', '5.3 BUSD', '5.2 BUSD',
       '5.1 BUSD', '5.0 BUSD', '4.9 BUSD', '4.8 BUSD', '4.7 BUSD',
       '4.6 BUSD', '4.5 BUSD', '4.4 BUSD', '4.3 BUSD', '4.2 BUSD',
       '4.1 BUSD', '4.0 BUSD', '3.9 BUSD', '3.8 BUSD', '3.7 BUSD',
       '3.6 BUSD', '3.5 BUSD', '3.4 BUSD', '3.3 BUSD', '3.2 BUSD',
       '3.1 BUSD', '3.0 BUSD', '2.9 BUSD', '2.8 BUSD', '2.7 BUSD',
       '2.6 BUSD', '2.5 BUSD', '2.4 BUSD', '2.3 BUSD', '2.2 BUSD',
       '2.1 BUSD', '2.0 BUSD', '1.9 BUSD', '1.8 BUSD', '1.7 BUSD',
       '1.6 BUSD', '1.5 BUSD', '1.4 BUSD', '1.3 BUSD', '1.2 BUSD',
       '1.1 BUSD', '1.0 BUSD'], dtype=object)

In [156]:
final_df.Gender_cat.unique()

array(['Not Available', 'Male', 'Female'], dtype=object)

In [157]:
final_df.drop('Gender', axis=1, inplace=True)

In [158]:
final_df.columns

Index(['ID', 'First Name', 'Last Name', 'Position', 'Worth', 'Source', 'Age',
       'Country', 'Image', 'Gender_cat'],
      dtype='object')

In [159]:
column_order = ['ID', 'Position','Worth', 'First Name', 'Last Name','Age', 'Gender_cat', 'Source',
       'Country', 'Image']

In [160]:
final_df = final_df[column_order]

In [161]:
final_df.head()

,ID,Position,Worth,First Name,Last Name,Age,Gender_cat,Source,Country,Image
0,5227,1,112.0 BUSD,Jeff,Bezos,54,Not Available,Technology ==> Amazon,United States,https://specials-images.forbesimg.com/imageser...
1,2642,2,90.0 BUSD,Bill,Gates,62,Male,Technology ==> Microsoft,None,https://specials-images.forbesimg.com/imageser...
2,5422,3,84.0 BUSD,Warren,Buffett,87,Male,Finance and Investments ==> Berkshire Hathaway,None,https://specials-images.forbesimg.com/imageser...
3,8183,4,72.0 BUSD,Bernard,Arnault,69,Male,Fashion & Retail ==> LVMH,France,https://specials-images.forbesimg.com/imageser...
4,5642,5,71.0 BUSD,Mark,Zuckerberg,33,Male,Technology ==> Facebook,USA,https://specials-images.forbesimg.com/imageser...

In [ ]:
final_df.to_csv(index=False)